{
  "type": "article",
  "id": "1hk0m7pfwpjs",
  "created": "2023-12-31T19:04:58.620Z",
  "updated": "2023-12-31T19:04:58.620Z",
  "content": {
    "title": "Promesa de Puerto Rico",
    "tags": "personal, Puerto Rico, Christmas",
    "slug": "promesa-de-puerto-rico",
    "text": "I'm still thinking of Christmas, because it's still Christmas for me. Puerto Ricans supposedly have the longest Christmas in the world, from Thanksgiving to January 14. I'm not sure if that's actually true, but it certainly feels true in the Diáspora Americana.\n\nI grew up a Baptized, Communionized, and Confirmed Catholic in a practicing-but-that's-none-of-your-business family. Of course, the Catholic part is important for the supposed \"real\" meaning of Christmas, but it's the Puerto Rican part that is joyful, nostalgic, and worth trying to replicate. Christmas in Puerto Rico means a nauseating excess of food, an irresponsible volume of alcohol, a claustrophobic thickness of family gatherings, a grueling barrage of song and dance, and, taken all together, it's just enough.\n\nMy favorite memories are of _promesas_ at my great-grandmother Gínea's house on Christmas Eve. _Promesa_ translates to \"promise\" in English, but in Puerto Rico it takes the form of a solemn oath to God to observe or fulfill something for a length of time in \"exchange\" for the object of some supplication. You are honor-bound to the full length of the promesa whether you get what you wanted or not. (This is an oversimplification though... you can't really \"bargain\" with God!) \n\nIn most Catholic traditions, the promesa takes the form of not eating particular foods or not shaving your beard for a few months or a few years, but in Puerto Rico it usually meant you were promising to hold an \"open door\" party on a particular day for a number of years. This is how promesas ended up being something you can attend. Great-grandmother Gínea had a promesa on Christmas Eve for as long as I knew her, but I never knew the subject of her plea to God. Maybe nobody did.\n\nThere was always food, immediate and extended family, people I had never met, and music, of course, but the music was always played live. Older men in _guayaberas_ playing guitar, cuatro, güiro, maraca, and bongó. Singing an alternating current of devout hymns and raunchy folk songs, [often improvised](https://www.youtube.com/watch?v=GnVq0TQ75KM), with a half-smoked cigarette dangling from their lip. The collective laughter when a prospective singer drunkenly misses their cue and has to wait till the next bar of the [seis chorreao](https://www.youtube.com/watch?v=0IklyG1y9JQ). I like to think that only playing live music was part of the promesa, but I'm not sure.\n\nI've just realized that the intense joy I feel when I hear students practicing instruments outside a music school probably comes from my great-grandmother's promesa. I remember playing in the street with my cousins at night and hearing the music hang in the air. The hint of chill in the breeze. The smell of my great-grandmother's hibiscus bushes. The twinkle of Orion's belt. (To us they were the Three Wise Kings.) The warm yellow glow through the persiana windows against the moon's electric blue.\n\n---\n\nI googled \"promesa de Puerto Rico\" recently to try to find other recollections that felt like mine, but the entire first page of results was for PROMESA: the Puerto Rico Oversight, Management, and Economic Stability Act. My most vivid, cherished memories, plastered over with colonialism and austerity. I shuddered at the perverse cruelty.\n\nWell. Fuck that shit. I'm still here and I still remember when Christmas could be beautiful. Que Viva la Navidad Boricua y que [Viva Puerto Rico Libre](https://www.youtube.com/watch?v=c0SaAJzm4oo). The diásporricans are bound by promesa to celebrate Puerto Rican Christmas wherever we are until our country is free."
  }
}
